{
  "misko": {
    "name": "Miško Hevery",
    "picture": "misko.jpg",
    "twitter": "mhevery",
    "website": "http://misko.hevery.com",
    "bio": "Miško Hevery is the creator of AngularJS framework. He has passion for making complex things simple. He currently works at Google, but has previously worked at Adobe, Sun Microsystems, Intel, and Xerox, where he became an expert in building web applications in web related technologies such as Java, JavaScript, Flex and ActionScript.",
    "group": "Angular"
  },

  "igor": {
    "name": "Igor Minar",
    "picture": "igor-minar.jpg",
    "twitter": "IgorMinar",
    "website": "https://google.com/+IgorMinar",
    "bio": "Igor is a software engineer at Google. He is a lead on the Angular project, practitioner of test driven development, open source enthusiast, hacker. In his free time, Igor enjoys spending time with his wife and two kids, doing outdoor activities (including but not limited to sports, gardening and building retaining walls).",
    "group": "Angular"
  },

  "naomi": {
    "name": "Naomi Black",
    "picture": "naomi.jpg",
    "twitter": "naomitraveller",
    "website": "http://google.com/+NaomiBlack",
    "bio": "Naomi is Angular's TPM generalist and jack-of-all-trades. She supports Angular's internal Google users and solves hard-to-define problems. She's been at Google since 2006, as a technical program manager on projects ranging from Accessibility to Google Transit. She fights daleks in her spare time.",
    "group": "Angular"
  },

  "brad": {
    "name": "Brad Green",
    "picture": "brad-green.jpg",
    "twitter": "bradlygreen",
    "website": "https://plus.google.com/+BradGreen",
    "bio": "Brad Green works at Google as an engineering director. Brad manages the Google Sales Platform suite of projects as well as the AngularJS framework. Prior to Google, Brad worked on the early mobile web at AvantGo, founded and sold startups, and spent a few hard years toiling as a caterer. Brad's first job out of school was as lackey to Steve Jobs at NeXT Computer writing demo software and designing his slide presentations. Brad enjoys throwing dinner parties with his wife Heather and putting on plays with his children.",
    "group": "Angular"
  },

  "juleskremer": {
    "name": "Jules Kremer",
    "picture": "juleskremer.jpg",
    "twitter": "jules_kremer",
    "website": "https://plus.google.com/+JulesKremer",
    "bio": "Jules is Head of Angular Developer Relations at Google.  When not working with developers, Jules is often bending into pretzel-like shapes, creating paths through thick jungle with a machete or drinking really awesome beer.",
    "group": "Angular"
  },

  "jelbourn": {
    "name": "Jeremy Elbourn",
    "picture": "jelbourn.jpg",
    "twitter": "jelbourn",
    "website": "https://plus.google.com/+JeremyElbourn/",
    "bio": "Angular Material Team Lead. FE Engineer @ Google specializing in AngularJS, component design, and the cleanest of code.",
    "group": "Angular"
  },

  "pete": {
    "name": "Pete Bacon Darwin",
    "picture": "pete.jpg",
    "twitter": "petebd",
    "website": "http://www.bacondarwin.com",
    "bio": "AngularJS for JS Team Lead. Pete has been working on the core team since 2012 and became the team lead for the AngularJS for JS branch in November 2014. He has co-authored a book on AngularJS and regularly talks about and teaches Angular.",
    "group": "Angular"
  },

  "stephenfluin": {
    "name": "Stephen Fluin",
    "picture": "stephenfluin.jpg",
    "twitter": "stephenfluin",
    "website": "https://plus.google.com/+stephenfluin",
    "bio": "Stephen is a Developer Advocate working on the Angular team. Before joining Google, he was a Google Expert. Stephen loves to help enterprises use technology more effectively.",
    "group": "Angular"
  },

  "robwormald": {
    "name": "Rob Wormald",
    "picture": "rob-wormald.jpg",
    "twitter": "robwormald",
    "website": "http://github.com/robwormald",
    "bio": "Rob is a Developer Advocate on the Angular team at Google. He's the Angular team's resident reactive programming geek and founded the Reactive Extensions for Angular project, ngrx.",
    "group": "Angular"
  },

  "tobias": {
    "name": "Tobias Bosch",
    "picture": "tobias.jpg",
    "twitter": "tbosch1009",
    "website": "https://plus.google.com/+TobiasBosch",
    "bio": "Tobias Bosch is a software engineer at Google. He is part of the Angular core team and works on Angular.",
    "group": "Angular"
  },

  "rado": {
    "name": "Rado Kirov",
    "picture": "rado.jpg",
    "twitter": "radokirov",
    "website": "https://plus.sandbox.google.com/+RadoslavKirov",
    "bio": "Rado has been on the Angular Core team since Summer 2014. Before Angular, he worked on the Adsense serving stack, responsible for serving billions of ads daily. Being passionate about open source, he made contributions to Angular as a Google-20% project, before making the fulltime jump. He is a recovering academic; ask him about error-correcting codes from algebraic curves (or don't).",
    "group": "Angular"
  },

  "alexeagle": {
    "name": "Alex Eagle",
    "picture": "alex-eagle.jpg",
    "twitter": "jakeherringbone",
    "website": "http://google.com/+alexeagle",
    "bio": "Alex works on language tooling for JavaScript and TypeScript. Previously Alex spent five years in Google's developer testing tools. He has developed systems including Google's continuous integration service, capturing build&test failures, and explaining them to developers. Before Google, Alex worked at startups including Opower, and consulted for large government IT. In his 20% time, he created the Error-Prone static analysis tool, which detects common Java programming mistakes and reports them as compile errors.",
    "group": "Angular"
  },

  "martinprobst": {
    "name": "Martin Probst",
    "picture": "martin-probst.jpg",
    "twitter": "martin_probst",
    "website": "http://probst.io",
    "bio": "Martin is a software engineer at Google in the AngularJS team. He holds a MSc in Software Engineering from HPI in Potsdam, Germany. Before joining the AngularJS team at Google, he worked at a database startup in the Netherlands, at EMC, at SAP, and as a freelancer. In his free time, he likes to cook and sail, not necessarily at the same time.",
    "group": "Angular"
  },

  "julieralph": {
    "name": "Julie Ralph",
    "picture": "julie-ralph.jpg",
    "twitter": "SomeJulie",
    "website": "https://plus.google.com/+JulieRalph",
    "bio": "Julie Ralph works as a Software Engineer in Test at Google in Seattle and is the lead developer on the Angular end-to-end testing framework Protractor.",
    "group": "Angular"
  },

  "alexrickabaugh": {
    "name": "Alex Rickabaugh",
    "picture": "alex-rickabaugh.jpg",
    "twitter": "synalx",
    "website": "https://plus.google.com/+AlexRickabaugh/about",
    "bio": "Core team member working to optimize the Angular platform for the next generation of applications, including mobile. Before joining the Angular team, Alex worked in the Google sales organization where he helped build the first large Angular application within Google.",
    "group": "Angular"
  },

  "matias": {
    "name": "Matias Niemela",
    "picture": "matias.jpg",
    "twitter": "yearofmoo",
    "website": "http://yearofmoo.com",
    "bio": "Matias Niemela is a fullstack web developer who has been programming & building websites for over 10 years, and a core team member of AngularJS for two years. In the spring of 2015 Matias joined Angular full time at Google. In his free time Matias loves to build complex things and is always up for public speaking, travelling and tweaking his current Vim setup.",
    "group": "Angular"
  },

  "hansl": {
    "name": "Hans Larsen",
    "picture": "hansl.jpg",
    "twitter": "hanslatwork",
    "website": "http://www.codingatwork.com/",
    "bio": "Hans is a software engineer at Google on the Angular team and was previously at Slack. He works everyday to help make it easier for everyone to create beautiful, consistent web applications using Angular, using Material Design components and the CLI tool.",
    "group": "Angular"
  },

  "kara": {
    "name": "Kara Erickson",
    "picture": "kara-erickson.jpg",
    "twitter": "karaforthewin",
    "website": "https://github.com/kara",
    "bio": "Kara is a software engineer on the Angular team at Google and a co-organizer of the Angular-SF Meetup. Prior to Google, she helped build UI components in Angular for guest management systems at OpenTable.  She enjoys snacking indiscriminately and probably other things too.",
    "group": "Angular"
  },

  "chuckj": {
    "name": "Chuck Jazdzewski",
    "picture": "chuckj.jpg",
    "twitter": "chuckjaz",
    "website": "http://removingalldoubt.com",
    "bio": "Chuck is a Software Engineer on the Angular team at Google. He is a programming language geek, UI framework and component library veteran, and has a passion for simplifying the task of programming. Before Google, he worked at Microsoft and Borland.",
    "group": "Angular"
  },

  "vikram": {
    "name": "Vikram Subramanian",
    "picture": "vikram.jpg",
    "twitter": "vikerman",
    "bio": "Vikram is a Software Engineer on the Angular team focused on Engineering Productivity. That means he makes sure people on the team can move fast and not break things. Vikram enjoys doing Yoga and going on walks with his daughter.",
    "group": "Angular"
  },

  "maxsills": {
    "name": "Max Sills",
    "picture": "max-sills.jpg",
    "twitter": "angularjs",
    "website": "http://google-opensource.blogspot.com/",
    "bio": "Max Sills is Angular's Open Source lawyer.",
    "group": "Angular"
  },

  "pawel": {
    "name": "Pawel Kozlowski",
    "picture": "pawel.jpg",
    "twitter": "pkozlowski_os",
    "bio": "Open source hacker, AngularJS book author, AngularUI lead developer. Pawel is an software-development addict who believes in free, open source software. He is a core contributor to the AngularJS framework, AngularUI, Karma-runner and several other projects. He is the co-author of the \"Mastering Web Application Development with AngularJS\" book. When not coding, Pawel can be spotted speaking at various software development conferences.",
    "group": "Angular"
  },

  "paulgschwendtner": {
    "name": "Paul Gschwendtner",
    "picture": "devversion.jpg",
    "twitter": "DevVersion",
    "website": "https://github.com/DevVersion",
    "bio": "Paul is a 17-year-old developer living in Germany. While he attends school, Paul works as a core team member on Angular Material. Paul focuses on tooling and building components for Angular.",
    "group": "Angular"
  },

  "elad": {
    "name": "Elad Bezalel",
    "picture": "eladbezalel.jpg",
    "website": "https://github.com/EladBezalel",
    "bio": "Elad is a fullstack developer with a very strong love for design. Since 8 years old, he's been designing in Photoshop and later on fell in love with programing. This strong bond between design and computer programming gave birth to a new kind of love. And he is currently doing the combination of both, as a core member of the ngMaterial project.",
    "group": "Angular"
  },

  "marclaval": {
    "name": "Marc Laval",
    "picture": "marclaval.jpg",
    "twitter": "marclaval",
    "website": "https://github.com/mlaval",
    "bio": "Marc is a manager at Amadeus where he leads the team in charge of developing and recommending UI frameworks for the company. He is also an open source developer and a contributor to Angular.",
    "group": "Angular"
  },

  "wardbell": {
    "name": "Ward Bell",
    "picture": "wardbell.jpg",
    "website": "https://github.com/wardbell",
    "twitter": "wardbell",
    "bio": "Ward is an all-around developer with JavaScript, Node.js®, and .net chops. He's a frequent conference speaker and podcaster, trainer, Google Developer Expert for Angular, Microsoft MVP, and PluralSight author. He is also president of IdeaBlade, an enterprise software consulting firm and the makers of breeze.js. He would like to get more sleep and spend more time in the mountains.",
    "group": "Angular"
  },

  "martinstaffa": {
    "name": "Martin Staffa",
    "picture": "martinstaffa.jpg",
    "twitter": "Narretz",
    "bio": "Martin is an English major turned web developer who loves frontend stuff. He's been part of the AngularJS team since 2014. If you can't find him roaming the Github issue queues, he's probably out with his camera somewhere.",
    "group": "Angular"
  },

  "filipesilva": {
    "name": "Filipe Silva",
    "picture": "filipe-silva.jpg",
    "twitter": "filipematossilv",
    "website": "http://github.com/filipesilva",
    "bio": "Filipe is a passion-driven developer that always strives for the most elegant solution for each problem. He is currently an author for Angular.io, a core contributor for Angular-CLI and senior front end engineer at KonnectAgain. When not busy going through PRs, you can find him scouring reddit for new dinner recipes to cook or enjoying a craft beer in Dublin.",
    "group": "Angular"
  },

  "andrewseguin": {
    "name": "Andrew Seguin",
    "picture": "andrewseguin.jpg",
    "website": "http://github.com/andrewseguin",
    "bio": "Andrew is an engineer on the Angular Material team working on bringing material components to the world. When he’s not obsessing over pixels and design, he is probably off somewhere having adventures with his wife and daughters.",
    "group": "Angular"
  },

  "jesusrodriguez": {
    "name": "Jesús Rodríguez",
    "picture": "jesus-rodriguez.jpg",
    "twitter": "foxandxss",
    "website": "http://angular-tips.com",
    "bio": "Jesus is an open source lover, a book author and editor, and AngularUI lead developer. He is currently a core contributor to the UI Bootstrap project.",
    "group": "Angular"
  },

  "crisbeto": {
    "name": "Kristiyan Kostadinov",
    "picture": "crisbeto.jpg",
    "website": "http://crisbeto.com/",
    "bio": "Kristiyan is a front-end developer, passionate open-source contributor and a core team member on Angular Material.",
    "group": "Angular"
  },

  "gkalpak": {
    "name": "Georgios Kalpakas",
    "picture": "gkalpak.jpg",
    "twitter": "gkalpakas",
    "website": "https://github.com/gkalpak",
    "bio": "George is a Software Engineer with a passion for chess, robotics and automating stuff. He has a strong need to know how things work (so if you already know, he'd love to have a talk with you). He has been a member of the AngularJS team since 2014. When not doing geeky stuff, he is probably trying to convince his wife and kids to apply programming principles in real life. (Or is it the other way around?)",
    "group": "Angular"
  },
  "mmalerba": {
    "name": "Miles Malerba",
    "picture": "mmalerba.jpg",
    "bio": "Miles is a software engineer on the Angular Material team at Google. In addition to Javascripting he enjoys eating food and ogling cute puppies.",
    "group": "Angular"
  },

  "jasonaden": {
    "name": "Jason Aden",
    "picture": "jasonaden.jpg",
    "bio": "Jason is a software engineer at Google on the Angular Core team. He is enthusiastic about Angular and application development in the modern age. In his free time Jason enjoys spending time with his wife and four children and doing outdoor activities (hiking, fishing, snowboarding, etc.).",
    "group": "Angular"
  },

  "jeffwhelpley": {
    "name": "Jeff Whelpley",
    "picture": "jeffwhelpley.jpg",
    "twitter": "jeffwhelpley",
    "website": "https://medium.com/@jeffwhelpley",
    "bio": "Jeff Whelpley is a Google Developer Expert and the CTO of GetHuman. He is the co-organizer of the Angular Boston meetup group, co-creator of Angular Universal, former host of AngularAir and frequent speaker at Angular events.",
    "group": "GDE"
  },

  "pascalprecht": {
    "name": "Pascal Precht",
    "picture": "pascalprecht.jpg",
    "website": "https://twitter.com/PascalPrecht",
    "bio": "Pascal is a software engineer, author and Google Developer Expert for the Angular team. He loves contributing to open source and is the creator of the popular angular-translate module. In his spare time he’s fiddling with EDM production.",
    "group": "GDE"
  },

  "deborah": {
    "name": "Deborah Kurata",
    "picture": "deborah.jpg",
    "twitter": "deborahkurata",
    "website": "http://blogs.msmvps.com/deborahk/",
    "bio": "Deborah is a software developer, author, and Google Developer Expert. She is author of several Pluralsight courses including: 'Angular 2: Getting Started' and ‘Angular Routing’",
    "group": "GDE"
  },

  "alyssa": {
    "name": "Alyssa Nicoll",
    "picture": "mickey_mouse.jpg",
    "twitter": "alyssanicoll",
    "website": "alyssa.io",
    "bio": "I am an energetic, über passionate GDE and Web Dev. I have some Front-End and Angular courses on Egghead.io and Code School. I love to learn new things and share them with others. I Scuba Dive and have a toothless dog named 'Gummy'. My DM is always open, come talk sometime.",
    "group": "GDE"
  },

  "ralph": {
    "name": "Ralph Wang",
    "picture": "ralph.jpg",
    "twitter": "ralph_wang_gde",
    "bio": "Ralph(Zhicheng Wang) is a senior consultant at ThoughtWorks and also a GDE. He is a technology enthusiast and he is a passionate advocate of 'Simplicity, Professionalism and Sharing'. In his eighteen years of R&D career, he worked as tester, R&D engineer, project manager, product manager and CTO. He is immersed in the excitement of the arrival of the baby.",
    "group": "GDE"
  },

  "wassim": {
    "name": "Wassim Chegham",
    "picture": "wassim.jpg",
    "twitter": "manekinekko",
    "website": "https://medium.com/@wassimchegham",
    "bio": "Wassim (aka manekinekko on Twitter/Github) is a Developer Advocate at SFEIR, in Web technologies (Angular, Polymer, PWA, Web Components...). He is also a Developer Expert in Web technologies nominated by Google. He enjoys writing technical articles, meeting developers at events, speaking at conferences and contributing to open source projects. Wassim loves the Web Platform and works hard to move it forward.",
    "group": "GDE"
  },

  "chrisnoring": {
    "name": "Christoffer Noring",
    "picture": "chrisnoring.jpg",
    "twitter": "chris_noring",
    "website": "softchris.github.io",
    "bio": "Chris is a Full Stack Developer at McKinsey. A Google Developer Expert in Web Technologies and Angular. He is also a Nativescript Developer Expert. He is one of the organizers of the Angular conference ngVikings and an author of the book RxJS 5 Ultimate",
    "group": "GDE"
  },

  "jorgeucano": {
    "name": "Jorge Cano",
    "picture": "jorgeucano.jpg",
    "twitter": "jorgeucano",
    "website": "https://medium.com/@jorgeucano",
    "bio": "Jorge is a Full Stack Developer in ByteDefault, a professor for several courses related to JavaScript, a speaker, and an author of technical articles and the book \"Entendiendo Angular.\" He is a Google Developer Expert in web technologies (nominated by Google) and a NativeScript Developer Expert (nominated by Telerik).",
    "group": "GDE"
  },

  "toddmotto": {
    "name": "Todd Motto",
    "picture": "toddmotto.jpg",
    "twitter": "toddmotto",
    "website": "https://ultimateangular.com",
    "bio": "Owner and trainer at Ultimate Angular. Lives in England, UK. Has a love for teaching, OSS and speaking at conferences. Google Developer Expert for Web Technologies and Angular.",
    "group": "GDE"
  },

  "michaelprentice": {
    "name": "Michael Prentice",
    "picture": "michaelprentice.jpg",
    "twitter": "splaktar",
    "website": "https://www.DevIntent.com",
    "bio": "Lead for AngularJS Material. Owner and consultant at DevIntent. Ex-Angular GDE. Founder of the Google Developers Group (GDG) community on the Space Coast of Florida, USA.",
    "group": "Angular"
  },

  "mikebrocchi": {
    "name": "Mike Brocchi",
    "picture": "mike-brocchi.jpg",
    "twitter": "brocco",
    "bio": "Mike is a core team member of the Angular CLI team, a GDE and is also an instructor at egghead. Mike is passionate about helping others by writing code as well as teaching.",
    "group": "Angular"
  },

  "manfredsteyer": {
    "name": "Manfred Steyer",
    "picture": "steyer.jpg",
    "twitter": "ManfredSteyer",
    "website": "https://www.softwarearchitekt.at",
    "bio": "Trainer and Consultant with focus on Angular. Writes for O'Reilly, the German Java Magazine and Heise. Regularly speaks at conferences.",
    "group": "GDE"
  },

  "maximsalnikov": {
    "name": "Maxim Salnikov",
    "picture": "maximsalnikov.jpg",
    "twitter": "webmaxru",
    "website": "https://medium.com/@webmaxru",
    "bio": "Oslo-based web front-end engineer, a Google Developer Expert in Angular, Web technologies and IoT. Active public speaker & trainer for the developer events. Leader of Norway’s largest meetups dedicated to web front-end and mobile development. Founder of ngVikings and Mobile Era conferences. Progressive Web Apps advocate.",
    "group": "GDE"
  },

  "jeremywilken": {
    "name": "Jeremy Wilken",
    "picture": "jeremywilken.jpg",
    "twitter": "gnomeontherun",
    "website": "https://gnomeontherun.com",
    "bio": "Based in Austin Texas, Jeremy is an application architect and homebrewer. He is a Google Developer Expert in Web Technologies and Angular, with a focus on speaking and training and author of Angular in Action and Ionic in Action.",
    "group": "GDE"
  },

  "minko": {
    "name": "Minko Gechev",
    "picture": "minko.jpg",
    "twitter": "mgechev",
    "website": "http://blog.mgechev.com",
    "bio": "Software engineer who enjoys theoretical computer science and its practical applications. Author of the books 'Switching to Angular 2' and 'Getting Started with Angular', speaker and blogger. Working on tooling for Angular and TypeScript.",
    "group": "GDE"
  },

  "uri": {
    "name": "Uri Shaked",
    "picture": "urish.jpg",
    "twitter": "UriShaked",
    "website": "https://urish.org",
    "bio": "Uri Shaked is a Google Developer Expert for Web Technologies. He regularly writes about Web and IoT related technologies in his medium blog, and speaks about these topics in conferences and meetup around the world. Among his interests are reverse engineering, hardware hacking, building 3d-printed robots and games, playing music and Salsa dancing.",
    "group": "GDE"
  },

  "eusoj": {
    "name": "Josue Gutierrez",
    "picture": "josue.jpg",
    "twitter": "eusoj",
    "website": "http://techtam.io",
    "bio": "Based in Mexico, Josue has been web developer since the last 10 years, he is part of the Google Developer Expert Program, passionate about teaching and building communities",
    "group": "GDE"
  },

  "SanderElias": {
    "name": "Sander Elias",
    "picture": "sanderelias.jpg",
    "twitter": "esoSanderElias",
    "website": "https://sanderelias.nl",
    "bio": "Sander is a versed developer with over 4 decades of practice under his belt. He is also an Google Developer Expert for web, specializing in Angular. Organizer of meetups and conferences. Helping out others wherever he can. When he is not breathing code, he is fiddling around with IOT, photography, science and anything that might vaguely is gadget-like! Thinks he a master of the grill, but in reality you probably don't get a food-poisoning ;) Also, and actually the most important thing to him, he is a father of 4, and has the most patient girlfriend in the universe.",
    "group": "GDE"
  },

  "filipbech": {
    "name": "Filip Bruun Bech-Larsen",
    "picture": "filipbech.jpg",
    "twitter": "filipbech",
    "website": "http://filipbech.github.io/",
    "bio": "Filip is a Frontend developer from Denmark. He works at IMPACT, delivering large-scale, high-performance e-commerce to international clients - most often build in Angular. He runs the local Angular usergroup - ngAarhus, and gives talks/workshops around and beyond the country of Denmark.",
    "group": "GDE"
  },

  "ocombe": {
    "name": "Olivier Combe",
    "picture": "ocombe.jpg",
    "twitter": "ocombe",
    "bio": "Olivier is a passionate front-end engineer who loves interacting with the community by doing open source projects (ocLazyLoad, ngx-translate…), being a panelist at Angular-Air, giving talks or just chatting on Twitter and Slack. He’s a member of the Angular Core team and works on i18n.",
    "group": "Angular"
  },

  "cironunes": {
    "name": "Ciro Nunes",
    "picture": "cironunes.jpg",
    "twitter": "cironunesdev",
    "bio": "Ciro is the Lead Front-end Engineer of CrossEngage and Google Developer Expert in Web Technologies.",
    "group": "GDE"
  },

  "elecash": {
    "name": "Raúl Jiménez",
    "picture": "raul.jpg",
    "twitter": "elecash",
    "bio": "Raul works as a CEO and Front-end Architect at Byte Default for companies around the world helping them to build high-performance web apps. In his spare time he's usually working on Videogular, involved in local meetups, speaking at conferences and contributing to open source projects.",
    "group": "GDE"
  },

  "simpulton": {
    "name": "Lukas Ruebbelke",
    "picture": "lukas.jpg",
    "twitter": "simpulton",
    "bio": "Developer. Hacker. Community backer. Author and blogger. Console logger.",
    "group": "GDE"
  },

  "christianweyer": {
    "name": "Christian Weyer",
    "picture": "christianweyer.jpg",
    "twitter": "ChristianWeyer",
    "website": "https://www.thinktecture.com",
    "bio": "Co-founder and CTO of Thinktecture AG, as well as Google GDE and Microsoft MVP. Since two decades active as an engaged and passionate speaker on several software conferences and events all over the world. Some people call him 'Mr. Cross-Platform'.",
    "group": "GDE"
  },

  "shaireznik": {
    "name": "Shai Reznik",
    "picture": "shaireznik.jpg",
    "twitter": "shai_reznik",
    "website": "https://www.hirez.io",
    "bio": "Teaches Angular at HiRez.io – the most entertaining online courses on the web. An experienced developer, consultant and speaker also known for his unusual crazy Angular talks such as ng-wat, ng-show, ng-rap, etc. Shai is also the organizer of the largest JavaScript group in Israel and a professional Improv performer.",
    "group": "GDE"
  },

  "danwahlin": {
    "name": "Dan Wahlin",
    "picture": "danwahlin.jpg",
    "twitter": "DanWahlin",
    "website": "https://codewithdan.com",
    "bio": "Dan Wahlin founded Wahlin Consulting which provides consulting and onsite/online training services on Web technologies such as JavaScript, Angular, TypeScript, Node.js, C#, ASP.NET Core, Web API, and Docker. He’s also published many developer courses on Pluralsight.com and Udemy.com. Dan is a Google GDE, Docker Captain, and Microsoft MVP and Regional Director and speaks at conferences and user groups around the world.  Dan has written several books on Web technologies, hundreds of technical articles and blog posts (https://blog.codewithdan.com) and runs the 'Code with Dan Web Weekly Newsletter' - a great way to stay up on the latest technologies. Follow Dan on Twitter @DanWahlin.",
    "group": "GDE"
  },

  "joeeames": {
    "name": "Joe Eames",
    "picture": "joeeames.jpg",
    "twitter": "josepheames",
    "website": "https://joeeames.me",
    "bio": "Joe Eames is a developer and educator. He publishes course on Angular and JavaScript on Pluralsight.com. He is an organizer of ng-conf, a Google Developer Expert in Angular, gives lots of talks & workshops, and loves all things web.",
    "group": "GDE"
  },

  "willmendesneto": {
    "name": "Wilson Mendes",
    "picture": "willmendesneto.jpg",
    "twitter": "willmendesneto",
    "website": "https://willmendesneto.github.io",
    "bio": "GDE (Google Developer Expert) Angular and Web Technologies, GDG Salvador organizer, passionate about technology and active in communities with a focus on web development, including Angular, JavaScript, HTML5, CSS3, Workflow, web performance, security and Internet of things. Participates in events organization, speaker at conferences in Brazil and other countries and contributes to several open source projects.",
    "group": "GDE"
  },

  "jecelynyeen": {
    "name": "Jecelyn Yeen",
    "picture": "jecelynyeen.jpg",
    "twitter": "jecelynyeen",
    "website": "https://developers.google.com/experts/people/jecelyn-yeen",
    "bio": "GDE (Google Developer Expert) Angular and Web Technologies, Women Who Code KL Director, Jecelyn specializes in professional application development with technologies, including Angular, HTML5, Typescript, JavaScript, CSS, C#, NodeJs, Cloud and ASP.NET.",
    "group": "GDE"
  },

  "vincirufus": {
    "name": "Vinci Rufus",
    "picture": "vincirufus.jpg",
    "twitter": "areai51",
    "website": "https://developers.google.com/experts/people/vinci-rufus",
    "bio": "Director of Experience Technology at SapientRazorfish. Consults various brands on their frontend and mobile web architecture. A speaker at various forums and mentor at Launchpad Accelerator and ngGirls India. Spends free time playing with Angular, Preact, web-components  ",
    "group": "GDE"
  },

  "thierrychatel": {
    "name": "Thierry Chatel",
    "picture": "thierrychatel.jpg",
    "twitter": "ThierryChatel",
    "website": "http://www.methotic.com",
    "bio": "Thierry is a senior consultant and trainer, specialized on Angular, and a Google Developer Expert.",
    "group": "GDE"
  },

  "gerardsans": {
    "name": "Gerard Sans",
    "picture": "gerardsans.jpg",
    "twitter": "gerardsans",
    "website": "https://medium.com/@gerard.sans",
    "bio": "Gerard is very excited about the future of the Web and JavaScript. Always happy Computer Science Engineer and humble Google Developer Expert. He loves to share his learnings by giving talks, trainings and writing about cool technologies. He loves running AngularZone and GraphQL London, mentoring students and giving back to the community.",
    "group": "GDE"
  },

  "amcdnl": {
    "name": "Austin McDaniel",
    "picture": "amcdnl.jpeg",
    "twitter": "amcdnl",
    "website": "https://amcdnl.com",
    "bio": "Austin is an software architect with a passion for JavaScript and Angular. Austin loves to share his experiences with other like-minded developers by giving talks, blogging, podcasting and open-sourcing.",
    "group": "Angular"
  },

  "nirkaufman": {
    "name": "Nir Kaufman",
    "picture": "nirkaufman.jpg",
    "twitter": "nirkaufman",
    "website": "http://ngnir.life/",
    "bio": "Nir is a Principal Frontend Consultant & Head of the Angular department at 500Tech, Google Developer Expert and community leader. He organizes the largest Angular meetup group in Israel (Angular-IL), talks and teaches about front-end technologies around the world. He is also the author of two books about Angular and the founder of the 'Frontend Band'.",
    "group": "GDE"
  },

  "achautard": {
    "name": "Alain Chautard",
    "picture": "alainchautard.png",
    "twitter": "AlainChautard",
    "website": "http://www.angulartraining.com",
    "bio": "Alain Chautard is a Google Developer Expert in Web Technologies / Angular. He started working with Angular JS in 2011. Since then he has worked with all Angular versions on a daily basis, both as a developer and as a technical trainer. He is the organizer of the Sacramento Angular Meetup group, co-organizer of the Google Developer Group chapter in Sacramento, California, and published author of the Packt video course 'Getting Started with Angular'",
    "group": "GDE"
  },

  "coryrylan": {
    "name": "Cory Rylan",
    "picture": "cory-rylan.jpg",
    "twitter": "coryrylan",
    "website": "https://coryrylan.com",
    "bio": "Cory is a full time front end web developer. He works full time building responsive web applications and progressive web apps. When not building web apps he is busy teaching Angular and other web technologies in workshops and conferences. He loves the web and is optimistic of the places it can take us.",
    "group": "GDE"
  },

  "mhartington": {
    "name": "Mike Hartington",
    "picture": "mhartington.png",
    "twitter": "mhartington",
    "website": "https://mhartington.io",
    "bio": "Mike is a Developer Advocate for the Ionic Framework and a GDE in Angular. He spends most of his time making fast PWAs and exploring emerging web standards. When not behind a keyboard, you'll probably find him with a guitar and beer.",
    "group": "GDE"
  },

  "juristr": {
    "name": "Juri Strumpflohner",
    "picture": "juristr.jpg",
    "twitter": "juristr",
    "website": "https://juristr.com",
    "bio": "Juri is a software engineer and freelance trainer and consultant currently mostly focusing on the frontend side using JavaScript, TypeScript and Angular. He has a passion for teaching and sharing his knowledge and experiences with others. This mostly happens by writing tech articles for his personal blog, by creating video courses for Egghead.io, during on-site workshops at companies or by speaking at conferences. In his free time he enjoys practicing Yoseikan Budo, a martial art where he currently owns the 3rd DAN black belt.",
    "group": "GDE"
  },

  "mashhoodr": {
    "name": "Mashhood Rastgar",
    "picture": "mashhood.jpg",
    "twitter": "mashhoodr",
    "website": "http://imars.info/",
    "bio": "Mashhood is the principal technical consultant at Recurship and a Google Developer Expert. He  works with different startups in US and EU to helps them crawl through the technical maze and quickly build amazing products focused around the problems they are trying to solve. He specializes in using the latest web technologies available to execute the best possible solutions.",
    "group": "GDE"
  },

  "kimmaida": {
    "name": "Kim Maida",
    "picture": "kimmaida.jpg",
    "twitter": "KimMaida",
    "website": "https://kmaida.io/",
    "bio": "Kim is an an Angular consultant, developer, speaker, writer, and Google Developer Expert. She is passionate about learning from and sharing knowledge with other developers through blogging, speaking, workshops, and open source.",
    "group": "GDE"
  },

  "elanaolson": {
    "name": "Elana Olson",
    "picture": "elanaolson.jpg",
    "twitter": "elanathellama",
    "bio": "Elana is a Developer Relations intern on the Angular team at Google. She is working on migration paths from AngularJS to Angular and would love to chat about your experience with upgrading.",
    "group": "Angular"
  },

  "kevinyang": {
    "name": "Kevin Yang",
    "picture": "kevinyang.jpg",
    "twitter": "chgc",
    "website": "https://blog.kevinyang.net/",
    "bio": "Kevin is a Angular Taiwan, Angular Girls Taiwan community organzier. He loves sharing knowledge with other developers through blogging, speaking, workshops.",
    "group": "GDE"
  },

  "sajee": {
    "name": "Sajeetharan Sinnathurai",
    "picture": "sajee.jpg",
    "twitter": "kokkisajee",
    "website": "https://sajeetharan.herokuapp.com/",
    "bio": "Sajeetharan is a Developer, Top contributor on stackoverflow for #Angular, ng-SriLanka organizer. He makes use of his extensive knowledge over the past years to contribute to community to make the world a better place.",
    "group": "GDE"
  },

  "lacolaco": {
    "name": "Suguru Inatomi",
    "picture": "lacolaco.jpg",
    "twitter": "laco2net",
    "website": "https://lacolaco.net",
    "bio": "Suguru is a community-loving Frontend developer and a lead of Angular Japan User Group. He organizes the largest Angular event in Japan (ng-japan). And he is a contributor to Angular by sending patches, writing, speaking, and localizing resources in Japanese.",
    "group": "GDE"
  },

  "katerina": {
    "name": "Katerina Skroumpelou",
    "picture": "katerina.jpg",
    "twitter": "psybercity",
    "website": "https://mandarini.github.io/",
    "bio": "Katerina is a front end software engineer, a conference speaker and AngularAthens meetup organizer. She is obsessed with sharing knowledge about things she loves. She is also trying to support diversity in the community. She lives with her cat in Athens.",
    "group": "GDE"
  },

  "blove": {
    "name": "Brian Love",
    "picture": "brian-love.jpg",
    "twitter": "brian_love",
    "website": "https://brianflove.com",
    "bio": "Brian is a software engineer and GDE in Angular with a passion for learning, writing, speaking, teaching and mentoring. Brian has been building web applications for over 20 years and has long been a fanboy of JavaScript. When not in front of his Macbook Pro Brian is in the Rocky Mountains skiing or hiking.",
    "group": "GDE"
  }
}
