/**
 * @license
 * Copyright Google Inc. All Rights Reserved.
 *
 * Use of this source code is governed by an MIT-style license that can be
 * found in the LICENSE file at https://angular.io/license
 */

// THIS CODE IS GENERATED - DO NOT MODIFY
// See angular/tools/gulp-tasks/cldr/extract.js

(function(global) {
  global.ng = global.ng || {};
  global.ng.common = global.ng.common || {};
  global.ng.common.locales = global.ng.common.locales || {};
  const u = undefined;
  function plural(n) {
    if (n === 1) return 1;
    return 5;
  }
  global.ng.common.locales['el-cy'] = [
    'el-CY',
    [['πμ', 'μμ'], ['π.μ.', 'μ.μ.'], u],
    u,
    [
      ['Κ', 'Δ', 'Τ', 'Τ', 'Π', 'Π', 'Σ'],
      ['Κυρ', 'Δευ', 'Τρί', 'Τετ', 'Πέμ', 'Παρ', 'Σάβ'],
      [
        'Κυριακή', 'Δευτέρα', 'Τρίτη', 'Τετάρτη', 'Πέμπτη',
        'Παρασκευή', 'Σάββατο'
      ],
      ['Κυ', 'Δε', 'Τρ', 'Τε', 'Πέ', 'Πα', 'Σά']
    ],
    u,
    [
      ['Ι', 'Φ', 'Μ', 'Α', 'Μ', 'Ι', 'Ι', 'Α', 'Σ', 'Ο', 'Ν', 'Δ'],
      [
        'Ιαν', 'Φεβ', 'Μαρ', 'Απρ', 'Μαΐ', 'Ιουν', 'Ιουλ', 'Αυγ',
        'Σεπ', 'Οκτ', 'Νοε', 'Δεκ'
      ],
      [
        'Ιανουαρίου', 'Φεβρουαρίου', 'Μαρτίου', 'Απριλίου',
        'Μαΐου', 'Ιουνίου', 'Ιουλίου', 'Αυγούστου',
        'Σεπτεμβρίου', 'Οκτωβρίου', 'Νοεμβρίου', 'Δεκεμβρίου'
      ]
    ],
    [
      ['Ι', 'Φ', 'Μ', 'Α', 'Μ', 'Ι', 'Ι', 'Α', 'Σ', 'Ο', 'Ν', 'Δ'],
      [
        'Ιαν', 'Φεβ', 'Μάρ', 'Απρ', 'Μάι', 'Ιούν', 'Ιούλ', 'Αύγ',
        'Σεπ', 'Οκτ', 'Νοέ', 'Δεκ'
      ],
      [
        'Ιανουάριος', 'Φεβρουάριος', 'Μάρτιος', 'Απρίλιος',
        'Μάιος', 'Ιούνιος', 'Ιούλιος', 'Αύγουστος',
        'Σεπτέμβριος', 'Οκτώβριος', 'Νοέμβριος', 'Δεκέμβριος'
      ]
    ],
    [['π.Χ.', 'μ.Χ.'], u, ['προ Χριστού', 'μετά Χριστόν']],
    1,
    [6, 0],
    ['d/M/yy', 'd MMM y', 'd MMMM y', 'EEEE, d MMMM y'],
    ['h:mm a', 'h:mm:ss a', 'h:mm:ss a z', 'h:mm:ss a zzzz'],
    ['{1}, {0}', u, '{1} - {0}', u],
    [',', '.', ';', '%', '+', '-', 'e', '×', '‰', '∞', 'NaN', ':'],
    ['#,##0.###', '#,##0%', '#,##0.00 ¤', '#E0'],
    'EUR',
    '€',
    'Ευρώ',
    {'GRD': ['Δρχ'], 'JPY': ['JP¥', '¥'], 'THB': ['฿']},
    plural,
    [
      [
        ['πρωί', 'μεσημ.', 'απόγ.', 'βράδυ'], u,
        ['το πρωί', 'το μεσημέρι', 'το απόγευμα', 'το βράδυ']
      ],
      [
        ['πρωί', 'μεσημ.', 'απόγ.', 'βράδυ'], u,
        ['πρωί', 'μεσημέρι', 'απόγευμα', 'βράδυ']
      ],
      [['04:00', '12:00'], ['12:00', '17:00'], ['17:00', '20:00'], ['20:00', '04:00']]
    ]
  ];
})(typeof globalThis !== 'undefined' && globalThis || typeof global !== 'undefined' && global ||
   typeof window !== 'undefined' && window);
