/**
 * @license
 * Copyright Google Inc. All Rights Reserved.
 *
 * Use of this source code is governed by an MIT-style license that can be
 * found in the LICENSE file at https://angular.io/license
 */

// THIS CODE IS GENERATED - DO NOT MODIFY
// See angular/tools/gulp-tasks/cldr/extract.js

(function(global) {
  global.ng = global.ng || {};
  global.ng.common = global.ng.common || {};
  global.ng.common.locales = global.ng.common.locales || {};
  const u = undefined;
  function plural(n) {
    if (n === 1) return 1;
    return 5;
  }
  global.ng.common.locales['kk'] = [
    'kk',
    [['AM', 'PM'], u, u],
    u,
    [
      ['Ж', 'Д', 'С', 'С', 'Б', 'Ж', 'С'],
      ['жс', 'дс', 'сс', 'ср', 'бс', 'жм', 'сб'],
      [
        'жексенбі', 'дүйсенбі', 'сейсенбі', 'сәрсенбі',
        'бейсенбі', 'жұма', 'сенбі'
      ],
      ['жс', 'дс', 'сс', 'ср', 'бс', 'жм', 'сб']
    ],
    u,
    [
      ['Қ', 'А', 'Н', 'С', 'М', 'М', 'Ш', 'Т', 'Қ', 'Қ', 'Қ', 'Ж'],
      [
        'қаң.', 'ақп.', 'нау.', 'сәу.', 'мам.', 'мау.', 'шіл.', 'там.',
        'қыр.', 'қаз.', 'қар.', 'жел.'
      ],
      [
        'қаңтар', 'ақпан', 'наурыз', 'сәуір', 'мамыр', 'маусым',
        'шілде', 'тамыз', 'қыркүйек', 'қазан', 'қараша',
        'желтоқсан'
      ]
    ],
    [
      ['Қ', 'А', 'Н', 'С', 'М', 'М', 'Ш', 'Т', 'Қ', 'Қ', 'Қ', 'Ж'],
      [
        'қаң.', 'ақп.', 'нау.', 'сәу.', 'мам.', 'мау.', 'шіл.', 'там.',
        'қыр.', 'қаз.', 'қар.', 'жел.'
      ],
      [
        'Қаңтар', 'Ақпан', 'Наурыз', 'Сәуір', 'Мамыр', 'Маусым',
        'Шілде', 'Тамыз', 'Қыркүйек', 'Қазан', 'Қараша',
        'Желтоқсан'
      ]
    ],
    [
      ['б.з.д.', 'б.з.'], u,
      ['Біздің заманымызға дейін', 'біздің заманымыз']
    ],
    1,
    [6, 0],
    ['dd.MM.yy', 'y \'ж\'. dd MMM', 'y \'ж\'. d MMMM', 'y \'ж\'. d MMMM, EEEE'],
    ['HH:mm', 'HH:mm:ss', 'HH:mm:ss z', 'HH:mm:ss zzzz'],
    ['{1}, {0}', u, u, u],
    [',', ' ', ';', '%', '+', '-', 'E', '×', '‰', '∞', 'сан емес', ':'],
    ['#,##0.###', '#,##0%', '#,##0.00 ¤', '#E0'],
    'KZT',
    '₸',
    'Қазақстан теңгесі',
    {'JPY': ['JP¥', '¥'], 'KZT': ['₸'], 'RUB': ['₽'], 'THB': ['฿'], 'TWD': ['NT$']},
    plural,
    [
      [
        [
          'түнгі', 'түскі', 'таңғы', 'түстен кейінгі', 'кешкі',
          'түнгі'
        ],
        [
          'түн жарымы', 'түскі', 'таңғы', 'түстен кейінгі',
          'кешкі', 'түнгі'
        ],
        u
      ],
      [
        [
          'түн жарымы', 'талтүс', 'таң', 'түстен кейін', 'кеш',
          'түн'
        ],
        u, u
      ],
      [
        '00:00', '12:00', ['06:00', '12:00'], ['12:00', '18:00'], ['18:00', '21:00'],
        ['21:00', '06:00']
      ]
    ]
  ];
})(typeof globalThis !== 'undefined' && globalThis || typeof global !== 'undefined' && global ||
   typeof window !== 'undefined' && window);
