/**
 * @license
 * Copyright Google LLC All Rights Reserved.
 *
 * Use of this source code is governed by an MIT-style license that can be
 * found in the LICENSE file at https://angular.io/license
 */

// THIS CODE IS GENERATED - DO NOT MODIFY
// See angular/tools/gulp-tasks/cldr/extract.js

(function(global) {
global.ng = global.ng || {};
global.ng.common = global.ng.common || {};
global.ng.common.locales = global.ng.common.locales || {};
const u = undefined;
function plural(n) {
  return 5;
}
global.ng.common.locales['lo'] = [
  'lo',
  [['ກ່ອນທ່ຽງ', 'ຫຼັງທ່ຽງ'], u, u],
  u,
  [
    ['ອາ', 'ຈ', 'ອ', 'ພ', 'ພຫ', 'ສຸ', 'ສ'], ['ອາທິດ', 'ຈັນ', 'ອັງຄານ', 'ພຸດ', 'ພະຫັດ', 'ສຸກ', 'ເສົາ'],
    ['ວັນອາທິດ', 'ວັນຈັນ', 'ວັນອັງຄານ', 'ວັນພຸດ', 'ວັນພະຫັດ', 'ວັນສຸກ', 'ວັນເສົາ'],
    ['ອາ.', 'ຈ.', 'ອ.', 'ພ.', 'ພຫ.', 'ສຸ.', 'ສ.']
  ],
  u,
  [
    ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'],
    [
      'ມ.ກ.', 'ກ.ພ.', 'ມ.ນ.', 'ມ.ສ.', 'ພ.ພ.', 'ມິ.ຖ.', 'ກ.ລ.', 'ສ.ຫ.', 'ກ.ຍ.', 'ຕ.ລ.', 'ພ.ຈ.', 'ທ.ວ.'
    ],
    [
      'ມັງກອນ', 'ກຸມພາ', 'ມີນາ', 'ເມສາ', 'ພຶດສະພາ', 'ມິຖຸນາ', 'ກໍລະກົດ', 'ສິງຫາ', 'ກັນຍາ', 'ຕຸລາ', 'ພະຈິກ',
      'ທັນວາ'
    ]
  ],
  u,
  [['ກ່ອນ ຄ.ສ.', 'ຄ.ສ.'], u, ['ກ່ອນຄຣິດສັກກະລາດ', 'ຄຣິດສັກກະລາດ']],
  0,
  [6, 0],
  ['d/M/y', 'd MMM y', 'd MMMM y', 'EEEE ທີ d MMMM G y'],
  ['H:mm', 'H:mm:ss', 'H ໂມງ m ນາທີ ss ວິນາທີ z', 'H ໂມງ m ນາທີ ss ວິນາທີ zzzz'],
  ['{1}, {0}', u, u, u],
  [
    ',', '.', ';', '%', '+', '-', 'E', '×', '‰', '∞',
    'ບໍ່​ແມ່ນ​ໂຕ​ເລກ', ':'
  ],
  ['#,##0.###', '#,##0%', '¤#,##0.00;¤-#,##0.00', '#'],
  'LAK',
  '₭',
  'ລາວ ກີບ',
  {'JPY': ['JP¥', '¥'], 'LAK': ['₭'], 'THB': ['฿'], 'TWD': ['NT$'], 'USD': ['US$', '$']},
  'ltr',
  plural,
  [
    [
      ['ທ່ຽງຄືນ', 'ຕອນທ່ຽງ', 'ຕອນເຊົ້າ', 'ຕອນທ່ຽງ', 'ຕອນແລງ', 'ກາງຄືນ'],
      ['ທ່ຽງຄືນ', 'ຕອນທ່ຽງ', 'ຕອນເຊົ້າ', 'ຕອນບ່າຍ', 'ຕອນແລງ', 'ກາງຄືນ'],
      ['ທ່ຽງຄືນ', 'ຕອນທ່ຽງ', 'ຕອນເຊົ້າ', 'ຕອນບ່າຍ', 'ຕອນແລງ', 'ຕອນກາງຄືນ']
    ],
    [
      [
        'ທ່ຽງ​ຄືນ', 'ຕອນທ່ຽງ', '​ເຊົ້າ', 'ສ', 'ແລງ',
        '​ກາງ​ຄືນ'
      ],
      [
        'ທ່ຽງ​ຄືນ', 'ທ່ຽງ', '​ເຊົ້າ', 'ສວຍ', 'ແລງ',
        '​ກາງ​ຄືນ'
      ],
      ['ທ່ຽງຄືນ', 'ຕອນທ່ຽງ', '​ເຊົ້າ', 'ສວຍ', 'ແລງ', '​ກາງ​ຄືນ']
    ],
    [
      '00:00', '12:00', ['05:00', '12:00'], ['12:00', '16:00'], ['16:00', '20:00'],
      ['20:00', '05:00']
    ]
  ]
];
})(typeof globalThis !== 'undefined' && globalThis || typeof global !== 'undefined' && global ||
   typeof window !== 'undefined' && window);
